balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1526.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR5H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR5H" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR5H" edc:desc="" edc:mask="0xff" edc:name="TMR5H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnn-n" edc:cname="T5CON" edc:desc="" edc:impl="0xfd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuu-u" edc:name="T5CON" edc:nzwidth="8" edc:por="000000-0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5ON" edc:desc="" edc:mask="0x1" edc:name="TMR5ON" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="nT5SYNC" edc:desc="" edc:mask="0x1" edc:name="nT5SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS" edc:desc="" edc:mask="0x3" edc:name="T5CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR5CS" edc:desc="" edc:mask="0x3" edc:name="TMR5CS" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="T5OSCEN" edc:desc="" edc:mask="0x1" edc:name="T5OSCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS0" edc:desc="" edc:mask="0x1" edc:name="T5CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS1" edc:desc="" edc:mask="0x1" edc:name="T5CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5CS0" edc:desc="" edc:mask="0x1" edc:name="TMR5CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5CS1" edc:desc="" edc:mask="0x1" edc:name="TMR5CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrnn" edc:cname="T5GCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuxuu" edc:name="T5GCON" edc:nzwidth="8" edc:por="00000x00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T5GSS" edc:desc="" edc:mask="0x3" edc:name="T5GSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="T5GVAL" edc:desc="" edc:mask="0x1" edc:name="T5GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GGO_nDONE" edc:desc="" edc:mask="0x1" edc:name="T5GGO_nDONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GSPM" edc:desc="" edc:mask="0x1" edc:name="T5GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GTM" edc:desc="" edc:mask="0x1" edc:name="T5GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GPOL" edc:desc="" edc:mask="0x1" edc:name="T5GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5GE" edc:desc="" edc:mask="0x1" edc:name="TMR5GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T5GSS0" edc:desc="" edc:mask="0x1" edc:name="T5GSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GSS1" edc:desc="" edc:mask="0x1" edc:name="T5GSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR6" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR6" edc:desc="" edc:mask="0xff" edc:name="TMR6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR6" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR6" edc:desc="" edc:mask="0xff" edc:name="PR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T6CON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T6CON" edc:nzwidth="8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T6CKPS" edc:desc="" edc:mask="0x3" edc:name="T6CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR6ON" edc:desc="" edc:mask="0x1" edc:name="TMR6ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS" edc:desc="" edc:mask="0xf" edc:name="T6OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6CKPS0" edc:desc="" edc:mask="0x1" edc:name="T6CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6CKPS1" edc:desc="" edc:mask="0x1" edc:name="T6CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="9" edc:beginaddr="0x480" edc:endaddr="0x4A0" edc:regionid="sfr9">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="--n-----" edc:cname="WPUG" edc:desc="" edc:impl="0x20" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--1-----" edc:name="WPUG" edc:nzwidth="8" edc:por="--1-----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="WPUG5" edc:desc="" edc:mask="0x1" edc:name="WPUG5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
