balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1526.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP6CON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP6CON" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP6M" edc:desc="" edc:mask="0xf" edc:name="CCP6M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC6B" edc:desc="" edc:mask="0x3" edc:name="DC6B" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP6M0" edc:desc="" edc:mask="0x1" edc:name="CCP6M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6M1" edc:desc="" edc:mask="0x1" edc:name="CCP6M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6M2" edc:desc="" edc:mask="0x1" edc:name="CCP6M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6M3" edc:desc="" edc:mask="0x1" edc:name="CCP6M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC6B0" edc:desc="" edc:mask="0x1" edc:name="DC6B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC6B1" edc:desc="" edc:mask="0x1" edc:name="DC6B1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR7" edc:desc="" edc:name="CCPR7" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR7L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR7L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR7L" edc:desc="" edc:mask="0xff" edc:name="CCPR7L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR7H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR7H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR7H" edc:desc="" edc:mask="0xff" edc:name="CCPR7H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP7CON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP7CON" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP7M" edc:desc="" edc:mask="0xf" edc:name="CCP7M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC7B" edc:desc="" edc:mask="0x3" edc:name="DC7B" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP7M0" edc:desc="" edc:mask="0x1" edc:name="CCP7M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7M1" edc:desc="" edc:mask="0x1" edc:name="CCP7M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7M2" edc:desc="" edc:mask="0x1" edc:name="CCP7M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7M3" edc:desc="" edc:mask="0x1" edc:name="CCP7M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC7B0" edc:desc="" edc:mask="0x1" edc:name="DC7B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC7B1" edc:desc="" edc:mask="0x1" edc:name="DC7B1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR8" edc:desc="" edc:name="CCPR8" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR8L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR8L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR8L" edc:desc="" edc:mask="0xff" edc:name="CCPR8L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR8H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR8H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR8H" edc:desc="" edc:mask="0xff" edc:name="CCPR8H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP8CON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP8CON" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP8M" edc:desc="" edc:mask="0xf" edc:name="CCP8M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC8B" edc:desc="" edc:mask="0x3" edc:name="DC8B" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP8M0" edc:desc="" edc:mask="0x1" edc:name="CCP8M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8M1" edc:desc="" edc:mask="0x1" edc:name="CCP8M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8M2" edc:desc="" edc:mask="0x1" edc:name="CCP8M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8M3" edc:desc="" edc:mask="0x1" edc:name="CCP8M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC8B0" edc:desc="" edc:mask="0x1" edc:name="DC8B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC8B1" edc:desc="" edc:mask="0x1" edc:name="DC8B1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR9" edc:desc="" edc:name="CCPR9" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR9L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR9L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR9L" edc:desc="" edc:mask="0xff" edc:name="CCPR9L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR9H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR9H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR9H" edc:desc="" edc:mask="0xff" edc:name="CCPR9H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
